daisywheel-api/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE (published = true) ORDER BY id DESC

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "dek", "content", "created_at", "updated_at", "section_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"