daisywheel-api/app/controllers/magazines_controller.rb

  def index
    @magazines = Magazine.all
---
SELECT "magazines".* FROM "magazines"

    def set_magazine
      @magazine = Magazine.find(params[:id])
---
SELECT "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]