daisywheel-api/app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
    @top_story = Article.find_by_id(@section.top_story)
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_section
      @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]