daisywheel-api/app/controllers/edit/articles_controller.rb

  def index
    if params[:section_id]
      @articles = Article.where("section_id = ?",params[:section_id]).order("id DESC")
    else
      @articles = Article.order("id DESC")
---
SELECT "articles".* FROM "articles" WHERE (section_id = '1') AND (static_page = false) ORDER BY id DESC
SELECT "articles".* FROM "articles" WHERE "articles"."section_id" = $1  [["section_id", 1]]

  def create
    puts article_params
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "dek", "content", "static_page", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "published" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["published", true], ["updated_at", "2020-01-16 01:00:43.349381"], ["id", 2]]