daisywheel-api/app/controllers/edit/features_controller.rb

INSERT INTO "features" ("section_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["section_id", 1], ["article_id", 7], ["created_at", "2020-01-16 01:42:57.269899"], ["updated_at", "2020-01-16 01:42:57.269899"]]
---
    def create
      @feature = Feature.new(feature_params)

      if @feature.save

DELETE FROM "features" WHERE "features"."id" = $1  [["id", 3]]
---
    def destroy
      @feature.destroy

SELECT "features".* FROM "features" WHERE "features"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def set_feature
        @feature = Feature.find(params[:id])