daisywheel-api/app/controllers/edit/magazines_controller.rb

SELECT id, title, short_title FROM "sections"
---
  def show
    @sections = Section.all.select("id, title, short_title")

UPDATE "magazines" SET "top_story" = $1, "updated_at" = $2 WHERE "magazines"."id" = $3  [["top_story", 6], ["updated_at", "2020-01-16 18:03:05.019985"], ["id", 1]]
---
  def update
    if @magazine.update(magazine_params)

SELECT "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_magazine
      @magazine = Magazine.find(params[:id])