daisywheel-api/app/controllers/edit/sections_controller.rb

SELECT id, title, short_title FROM "sections"
---
  def index
    @sections = Section.all

SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."section_id" = $1  [["section_id", 1]]
SELECT "articles".* FROM "articles" ORDER BY id DESC
---
  def show
    @section = Section.find(params[:id])
    @articles = Article.with_attached_image.where("section_id = ?",params[:id]).where("static_page = false").order("id DESC")

    @articles.each do |article|

UPDATE "sections" SET "top_story" = $1, "updated_at" = $2 WHERE "sections"."id" = $3  [["top_story", 1], ["updated_at", "2020-01-16 00:40:58.716217"], ["id", 1]]
---
  def update
    if @section.update(section_params)